Tekla Open API Reference for Tekla Structures 2025
Task Constructor
Overload List
Name | Description
Task()
 Creates a new task instance.
Task(Identifier)
 Creates a task instance with a known identifier. Select the task after the creation.
Top
See Also
Reference
Task Class
Tekla.Structures.Model Namespace